Function/split.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Perl5 split 函数的使用详细讲解</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Perl5 split 函数的使用详细讲解"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-30T19:27+0800"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Perl5 split 函数的使用详细讲解</h1>

<p>文章来源与：<a href="http://perlmaven.com/perl-split">http://perlmaven.com/perl-split</a> 
翻译：扬眉剑（GRC）rongchaogao@gmail.com
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 一个简单的例子</a></li>
<li><a href="#sec-2">2 限制分成几分</a></li>
<li><a href="#sec-3">3 通过split给标量赋值</a></li>
<li><a href="#sec-4">4 用更复杂的正则分割</a></li>
<li><a href="#sec-5">5 按照多种字符分割</a></li>
<li><a href="#sec-6">6 分割字符</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1"><span class="section-number-3">1</span> 一个简单的例子</h3>
<div class="outline-text-3" id="text-1">




<pre class="example"><span class="linenr">1:  </span>use Data::Dumper;
<span class="linenr">2:  </span>my $str  = "ab cd ef gh ij";
<span class="linenr">3:  </span>my @word = split/\s+/,$str;
<span class="linenr">4:  </span>print Dumper(\@word);
</pre>

<p>
结果：
</p>


<pre class="example"><span class="linenr">1:  </span>$VAR1 = [
<span class="linenr">2:  </span>          'ab',
<span class="linenr">3:  </span>          'cd',
<span class="linenr">4:  </span>          'ef',
<span class="linenr">5:  </span>          'gh',
<span class="linenr">6:  </span>          'ij'
<span class="linenr">7:  </span>        ];
<span class="linenr">8:  </span>
</pre>

</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2"><span class="section-number-3">2</span> 限制分成几分</h3>
<div class="outline-text-3" id="text-2">




<pre class="example"><span class="linenr"> 1:  </span>use Data::Dumper;
<span class="linenr"> 2:  </span>my $str  = "ab cd ef gh ij";
<span class="linenr"> 3:  </span>my @word = split/\s+/,$str,2;
<span class="linenr"> 4:  </span>#添加一个参数2，这里整个字符串就被从前往后分成了两部分
<span class="linenr"> 5:  </span>print Dumper(\@word);
<span class="linenr"> 6:  </span>=结果
<span class="linenr"> 7:  </span>$VAR1 = [
<span class="linenr"> 8:  </span>          'ab',
<span class="linenr"> 9:  </span>          'cd ef gh ij'
<span class="linenr">10:  </span>        ];
<span class="linenr">11:  </span>=cut
<span class="linenr">12:  </span>use Data::Dumper;
<span class="linenr">13:  </span>my $str  = "ab cd ef gh ij";
<span class="linenr">14:  </span>my @word = split/\s+/,$str,3;
<span class="linenr">15:  </span>print Dumper(\@word);
<span class="linenr">16:  </span>=结果
<span class="linenr">17:  </span>$VAR1 = [
<span class="linenr">18:  </span>          'ab',
<span class="linenr">19:  </span>          'cd',
<span class="linenr">20:  </span>          'ef gh ij'
<span class="linenr">21:  </span>        ];
<span class="linenr">22:  </span>=cut
</pre>

</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3"><span class="section-number-3">3</span> 通过split给标量赋值</h3>
<div class="outline-text-3" id="text-3">

<ul>
<li>方法一：
</li>
</ul>




<pre class="example"><span class="linenr"> 1:  </span>my $str  = "ab cd ef gh ij";
<span class="linenr"> 2:  </span>my ($first,$second,$third,$four,$five) = split/\s+/,$str;
<span class="linenr"> 3:  </span>print "first $first\nsecond $second\nthird $third\nfour $four\nfive $five\n";
<span class="linenr"> 4:  </span>
<span class="linenr"> 5:  </span>=结果
<span class="linenr"> 6:  </span>first ab
<span class="linenr"> 7:  </span>second cd
<span class="linenr"> 8:  </span>third ef
<span class="linenr"> 9:  </span>four gh
<span class="linenr">10:  </span>five ij
</pre>

<ul>
<li>方法二： 
</li>
</ul>

<p>上面的程序可以达到我们的需求，但是，如果我们只需要其中的2个值。那么上面的程序就很繁琐了。
我们可以用下面改进的办法；
</p>


<pre class="example"><span class="linenr"> 1:  </span>my $str  = "ab cd ef gh ij";
<span class="linenr"> 2:  </span>my @word=split/\s+/,$str;
<span class="linenr"> 3:  </span>my $third=@word[2];
<span class="linenr"> 4:  </span>my $five =@word[4];
<span class="linenr"> 5:  </span>print "third $third\nfive $five\n";
<span class="linenr"> 6:  </span>
<span class="linenr"> 7:  </span>=结果
<span class="linenr"> 8:  </span>third ef
<span class="linenr"> 9:  </span>five ij
<span class="linenr">10:  </span>
</pre>

<ul>
<li>方法三：
</li>
</ul>

<p>上面的方法也成功的实现了我们的需求，但还是不够简洁，我们还可以通过下面的方法：
</p>


<pre class="example"><span class="linenr">1:  </span>my $str  = "ab cd ef gh ij";
<span class="linenr">2:  </span>my ($third,$five)=(split/\s+/,$str)[2,4];
<span class="linenr">3:  </span>print "third $third\nfive $five\n";
<span class="linenr">4:  </span>=结果
<span class="linenr">5:  </span>third ef
<span class="linenr">6:  </span>five ij
</pre>

</div>

</div>

<div id="outline-container-4" class="outline-3">
<h3 id="sec-4"><span class="section-number-3">4</span> 用更复杂的正则分割</h3>
<div class="outline-text-3" id="text-4">

<p>首先还是一个简单的例子；
</p>


<pre class="example"><span class="linenr"> 1:  </span>use Data::Dumper;
<span class="linenr"> 2:  </span>my $str="fname    = Foolname =    Baremail=foo@bar.com";
<span class="linenr"> 3:  </span>my @array=split/=/,$str;
<span class="linenr"> 4:  </span>print Dumper(\@array);
<span class="linenr"> 5:  </span>
<span class="linenr"> 6:  </span>=结果
<span class="linenr"> 7:  </span>$VAR1 = [
<span class="linenr"> 8:  </span>          'fname    ',
<span class="linenr"> 9:  </span>          ' Foolname ',
<span class="linenr">10:  </span>          '    Baremail',
<span class="linenr">11:  </span>          'foo.com'
<span class="linenr">12:  </span>        ];
</pre>

<p>
上面的结果有什么不妥的地方呢？我们发现分成的四部分中有空格的存在，而空格未必是我们想要的。
所以我们要对程序进行改进
</p>


<pre class="example"><span class="linenr"> 1:  </span>use Data::Dumper;
<span class="linenr"> 2:  </span>my $str="fname    = Foolname =    Baremail=foo@bar.com";
<span class="linenr"> 3:  </span>my @array=split/\s*=\s*/,$str;
<span class="linenr"> 4:  </span>print Dumper(\@array);
<span class="linenr"> 5:  </span>
<span class="linenr"> 6:  </span>=结果
<span class="linenr"> 7:  </span>$VAR1 = [
<span class="linenr"> 8:  </span>          'fname',
<span class="linenr"> 9:  </span>          'Foolname',
<span class="linenr">10:  </span>          'Baremail',
<span class="linenr">11:  </span>          'foo.com'
<span class="linenr">12:  </span>        ];
</pre>

<p>
我们还可以这样控制
</p>


<pre class="example"><span class="linenr"> 1:  </span>use Data::Dumper;
<span class="linenr"> 2:  </span>my $str="fname    = Foolname =    Baremail=foo@bar.com";
<span class="linenr"> 3:  </span>my @array=split/\s+=\s+/,$str;
<span class="linenr"> 4:  </span>print Dumper(\@array);
<span class="linenr"> 5:  </span>=结果
<span class="linenr"> 6:  </span>$VAR1 = [
<span class="linenr"> 7:  </span>          'fname',
<span class="linenr"> 8:  </span>          'Foolname',
<span class="linenr"> 9:  </span>          'Baremail=foo.com'
<span class="linenr">10:  </span>        ];
</pre>

<p>
上面的字符串$str有3个等号，我们最后的结果却只分成了三分。因为我们在分割的时候，
要求必须=两侧有空格的才进行分割。所以最后的一个等号两侧没有被分割。
</p></div>

</div>

<div id="outline-container-5" class="outline-3">
<h3 id="sec-5"><span class="section-number-3">5</span> 按照多种字符分割</h3>
<div class="outline-text-3" id="text-5">

<p>我们有这么一个字符串"fname=Foo&amp;lname=Bar&amp;email=foo@bar.com"我们既想用“=”分割，也想
用“&amp;”分割。怎么做到呢？
</p>


<pre class="example"><span class="linenr"> 1:  </span>use Data::Dumper;
<span class="linenr"> 2:  </span>my $str = 'fname=Foo&amp;lname=Bar&amp;email=foo@bar.com';
<span class="linenr"> 3:  </span>my @user = split /[=&amp;]/, $str;
<span class="linenr"> 4:  </span>print Dumper (\@user);
<span class="linenr"> 5:  </span>=结果
<span class="linenr"> 6:  </span>$VAR1 = [
<span class="linenr"> 7:  </span>          'fname',
<span class="linenr"> 8:  </span>          'Foo',
<span class="linenr"> 9:  </span>          'lname',
<span class="linenr">10:  </span>          'Bar',
<span class="linenr">11:  </span>          'email',
<span class="linenr">12:  </span>          'foo@bar.com'
<span class="linenr">13:  </span>        ];
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-3">
<h3 id="sec-6"><span class="section-number-3">6</span> 分割字符</h3>
<div class="outline-text-3" id="text-6">

<p>也许我们有时候还会有这样的要求“hello world”把这个字符串按照字符来分割，分割成"h""e""l"
等等。
</p>


<pre class="example"><span class="linenr"> 1:  </span>use Data::Dumper;
<span class="linenr"> 2:  </span>my $str = "Hello World";
<span class="linenr"> 3:  </span>my @chars = split //, $str;
<span class="linenr"> 4:  </span>print Dumper(\@chars);
<span class="linenr"> 5:  </span>
<span class="linenr"> 6:  </span>=结果
<span class="linenr"> 7:  </span>$VAR1 = [
<span class="linenr"> 8:  </span>          'H',
<span class="linenr"> 9:  </span>          'e',
<span class="linenr">10:  </span>          'l',
<span class="linenr">11:  </span>          'l',
<span class="linenr">12:  </span>          'o',
<span class="linenr">13:  </span>          ' ',
<span class="linenr">14:  </span>          'W',
<span class="linenr">15:  </span>          'o',
<span class="linenr">16:  </span>          'r',
<span class="linenr">17:  </span>          'l',
<span class="linenr">18:  </span>          'd'
<span class="linenr">19:  </span>        ];
</pre>

<p>
注意这里是用//来分割的。要和省略分割符号区别开，如果省略分割符号，默认用空格分割。
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-12-30T19:27+0800</p>
<p class="author">Author: </p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
